{
    "settings": [
        {
            "name": "alwaysTransmit",
            "tip": "Always transmit channel output data even when no sequence or effect is playing.  Some controllers may need constant data coming in to prevent them from going into a built in test mode.",
            "level": 1
        },
        {
            "name": "AudioFormat",
            "tip": "The Audio Format generated by the decoder can be changed to work with certain audio devices that can not work with multiple formats.  Leaving this setting at 'Default' is recommended unless you are experiencing issues",
            "level": 1
        },
        {
            "name": "AudioMixerDevice",
            "tip": "The Audio Mixer Device specifies the mixer device which should be used by FPP to control the volume of audio playback.",
            "level": 0
        },
        {
            "name": "AudioOutput",
            "tip": "The Audio Output Device determines which audio device is used for audio playback.  This may be an onboard analog audio device, the HDMI output on a Raspberry Pi, or a USB sound card.",
            "level": 0
        },
        {
            "name": "backgroundColor",
            "tip": "The background border of the FPP User Interface can be changed to make it easier to distinguish visually between multiple installed FPP instances.",
            "level": 0
        },
        {
            "name": "blankBetweenSequences",
            "tip": "Blank Between Sequences instructs FPP to send blanking data out all channel outputs between each sequence played in a playlist.  This can be used to turn off all the lights after each sequence if the sequences do not end with all channels turned off.",
            "level": 0
        },
        {
            "name": "bootDelay",
            "tip": "The time that FPP waits after system boot up to start fppd.  For environments that are powered down regularly, fppd may start up quicker than the network environment fully starts up which may cause E1.31 multicast to not work properly.  Setting a Boot Delay will cause fppd to wait 'X' number of seconds to start which can give the network switches and routers time to fully start up.",
            "level": 1
        },
        {
            "name": "disableIPAnnouncement",
            "tip": "During boot, the current IP addresses will be announced over the audio output.  This setting allows disabling this announcement for production use when the Pi is connected to a FM transmitter or speakers.",
            "level": 0
        },
        {
            "name": "disableUIWarnings",
            "tip": "Disable the 'restart required' and 'reboot required' warnings that appear at the top of the page when settings are changed.",
            "level": 1
        },
        {
            "name": "E131BridgingInterval",
            "tip": "The default Transmit Interval in E1.31 Bridge Mode is 50ms.  This setting allows changing this to match the rate the player is outputting. WARNING - Some output devices such as the FPD do not support rates other than 50ms.",
            "level": 1
        },
        {
            "name": "ForceHDMI",
            "tip": "Force the Raspberry Pi to use the HDMI output as the default display.  This is sometimes required if the HDMI display is not detected properly or is not powered when the Pi is booted.  Turning this setting on will prevent using the Composite output on the Pi until the setting is disabled.",
            "level": 0
        },
        {
            "name": "gitBranch",
            "tip": "Switch code branches to test features outside the current release branch.  The 'master' branch is the main development branch for the next version of FPP.  There may also be a 'master-vY.x' branch were 'Y' is the major FPP version.  These master-v* branches are created to allow development on the next major release to continue in the master branch while bugfixes for the 'Y' release are applied only to the master-vY.x branch.",
            "level": 1
        },
        {
            "name": "LEDDisplayType",
            "tip": "OLED Status Display type.  There are serveral OLED displays which can be attached to the i2c bus on the Pi and BeagleBone.  This setting is used to configure the size and type of display installed.",
            "level": 0
        },
        {
            "name": "Locale",
            "tip": "The Locale is used to automatically configure some locale or region-specific functionality within FPP such as the list of Holidays included in the FPP Scheduler.",
            "level": 0
        },
        {
            "name": "LogLevel",
            "tip": "The Log Level controls the detail amount included in the FPP logs.  It is recommended that the Log Level be set to 'Warn' on production systems",
            "level": 0
        },
        {
            "name": "LogMask",
            "tip": "The Log Mask controls which sections of code are logged.  This allows a user to disable logging in most sections of the code and turn up the Log Level on specific areas of code for troubleshooting.  It is recommended that the Log Mask be set to 'Most' on production systems.",
            "level": 0
        },
        {
            "name": "masqUIPlatform",
            "tip": "The UI Masquerade Platform allows a developer to have a system masquerade as another platform to help test different UI configurations.  This may not work in all situations where the actual platform is required such as if the detection of certain hardware is required to configure the UI.",
            "level": 3
        },
        {
            "name": "mediaOffset",
            "tip": "The Media Offset value allows adjusting the synchronization of the media and sequences being played.  The value is specified in milliseconds.  A positive value moves the media ahead, a negative value moves the media back.  Changing this value requires a FPPD restart.  WARNING - This offset applies to all media files played.  If your media files require different offsets per file then you will have to edit the audio files or sequences to bring them into sync.",
            "level": 1
        },
        {
            "name": "OMXPlayerAudioOutput",
            "tip": "OMXplayer is used for hardware accelerated video playback on the Rasbperry Pi.  This setting allows controlling whether the omxplayer audio output goes out the HDMI port, the local analog audio port, or uses ALSA to allow add-on USB sound cards to be used.  The recommended default is ALSA.",
            "level": 0
        },
        {
            "name": "openStartDelay",
            "tip": "An extra delay (in ms) between the master sending the 'Open' command and actually starting the sequence.  This can be used to allow the remotes to have extra time to open the sequence, process videos, etc...   This requires master and remote to both be running FPP 3.2 or newer.  For complext MP4 files on remotes, a value of around 650-800 is likely needed for the remote video to be loaded and buffers filled prior to first frame being displayed.",
            "level": 1
        },
        {
            "name": "pauseBackgroundEffects",
            "tip": "Background effects normally continue to run when a sequence is playing.  This setting instructs FPP to pause all background effects when a sequence is running.  When the sequence stops running, the background effects resume playback.",
            "level": 0
        },
        {
            "name": "remoteIgnoreSync",
            "tip": "When enabled, videos played with omxplayer on the remote will be started and stopped when the master sends the start/stop events, but no attempt will be made to keep the video in sync with the master during playback.  The video will run smoother, but may get out of sync with the master.",
            "level": 1
        },
        {
            "name": "remoteOffset",
            "tip": "The Remote Offset value allows adjusting the synchronization of a FPP Remote.  The value is specified in milliseconds.  A positive value moves the remove ahead, a negative value moves the remote back.  Changing this value requires a FPPD restart on the Remote.  WARNING - This offset applies to both sequence and media files.  If your media files require different offsets per file then you will need to edit the media files to bring them into sync.",
            "level": 1
        },
        {
            "name": "screensaver",
            "tip": "Enable screensaver to blank the Raspberry Pi display after startup.  This is useful when you have a projector attached to the HDMI/composite output and do not want the boot screen text console to display on the projector when no video is playing.",
            "level": 0
        },
        {
            "name": "showAllOptions",
            "tip": "If FPPD can detect what hardware (cape/hat/etc...) is connected, certain options that are either incompatible with the hardware or are rarely used may not be displayed.  This setting forces FPP to display to display all options even for hardware that was not detected.",
            "level": 1
        },
        {
            "name": "uiLevel",
            "tip": "The UI Level setting controls the level of settings that are exposed in the UI.  The default 'Basic' level exposes settings which are used by most users.  The 'Advanced' level provides additional settings to control most features within FPP.  'Guru' is for experts only and exposes settings which may negatively affect system performance or cause issues if incorrectly used.  'Experimental' is for developer and beta tester use.",
            "level": 0
        },
        {
            "name": "VideoOutput",
            "tip": "The Default Video Output device to be used when playing a video.  On all FPP systems, video played in a playlist can be displayed on a Pixel Overlay model.  On the Raspberry Pi, video can also be played on the HDMI/Composite video outputs.",
            "level": 0
        }
    ]
}
